

# CiscoルータでGuestShellを利用する  
---


## 演習における役割と、環境のパラメータ
- X: ご自身のPod番号
- Router1: CSR1



## 注意
- 手順例の画像は<B>pod255</B>に準拠したパラメータのものです
- 手順内の<B>X</B>表記はご自身のpod番号に読み替えてください

---



<!--

【補足】
GusetShellのconfigは削除しても自動的に回復します。  
これは演習環境固有の仕様です。  
既存のconfigを削除するのが困難であるため、既存のonfigを上書きして学習体験を得ます。  

# 既定のGuestShellを削除する

1. Router1(CSR1)の管理画面に接続する  

1. 既定のGuestShellを削除する 

    1. Router1(CSR1)で以下のコマンドを実行し、既定のGuestShellを削除する   
        CSR1# ***conf t***  
        CSR1(config)# ***no app-hosting appid guestshell***   
        CSR1(config)# ***end***    

        > 【補足】  
        > 演習環境基盤の仕様により、このルータにはGuestShellが自動的に作成されています。  
        > GuestShell構成の手順を学習するため、既定のGuestShellを削除します。  


既定のGusetShellは以下の構成です
CSR1#show running-config | section app-hosting
app-hosting appid guestshell
    app-vnic gateway1 virtualportgroup 0 guest-interface 0
    guest-ipaddress 192.168.35.102 netmask 255.255.255.0
    app-default-gateway 192.168.35.101 guest-interface 0
    name-server0 8.8.8.8
CSR1#

CSR1#show run int VirtualPortGroup0 
Building configuration...

Current configuration : 140 bytes
!
interface VirtualPortGroup0
 vrf forwarding GS
 ip address 192.168.35.101 255.255.255.0
 ip nat inside
 no mop enabled
 no mop sysid
end

CSR1#show run | sec iox
iox

CSR1#show run | sec ip nat
ip nat inside source list GS_NAT_ACL interface GigabitEthernet1 vrf GS overload


    1. Router1(CSR1)で以下のコマンドを実行し、GuestShellのconfigが存在しないことを確認する      
        CSR1# ***show run | sec app-hosting***  
  
        ```

        CSR1#conf t  
        CSR1(config)#no app-hosting appid guestshell   
        CSR1(config)#end    
        CSR1#show run | sec app-hosting
        CSR1#
        ```

-->


# アプリケーション ホスティングを構成する  

1. Router1(CSR1)で以下のコマンドを実行し、IOx機能を有効化する    
    CSR1# ***conf t***  
    CSR1(config)# ***iox***   
    ```
    CSR1#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
    CSR1(config)#
    CSR1(config)#iox
    CSR1(config)#
    ```

1. Router1(CSR1)で以下のコマンドを実行し、IOx機能がRunning状態であることを確認する     
    CSR1(config)# ***do show iox-service***   

    ```
    CSR1(config)#do show iox-service 

    IOx Infrastructure Summary:
    ---------------------------
    IOx service (CAF) 1.11.0.5     : Running
    IOx service (HA)               : Not Supported 
    IOx service (IOxman)           : Running 
    IOx service (Sec storage)      : Not Supported 
    Libvirtd 1.3.4                 : Running

    CSR1(config)#

    ```
    > 【確認ポイント】
    > "IOx service (CAF)" が "Running" であることを確認する。  

<!--
IOxを有効化していない場合は、以下の出力を得ます。
CSR1#show iox-service

IOx Infrastructure Summary:
---------------------------
IOx service (CAF)              : Not Running
IOx service (HA)               : Not Supported 
IOx service (IOxman)           : Not Running
IOx service (Sec storage)      : Not Supported 
Libvirtd 1.3.4                 : Running

CSR1#
-->


1. Router1(CSR1)で以下のコマンドを実行し、guestshell という名称のApplication Hostingを定義する  
    CSR1(config)# ***app-hosting appid guestshell***   

    ```
    CSR1(config)#app-hosting appid guestshell
    CSR1(config-app-hosting)#
    ```

1. Router1(CSR1)で以下のコマンドを実行し、GuestShell(CentOS)のインターフェイスのIPアドレスを設定する    
    CSR1(config-app-hosting)# ***app-vnic gateway1 virtualportgroup 0 guest-interface 0***  
    CSR1(config-app-hosting-gateway0)# ***guest-ipaddress 192.168.X.1 netmask 255.255.255.0***   
    CSR1(config-app-hosting-gateway0)# ***exit***  

    ```
    CSR1(config-app-hosting)#app-vnic gateway1 virtualportgroup 0 guest-interface 0
    CSR1(config-app-hosting-gateway0)#guest-ipaddress 192.168.255.1 netmask 255.255.255.0 
    CSR1(config-app-hosting-gateway0)#exit
    CSR1(config-app-hosting)#
    ```




1. Router1(CSR1)で以下のコマンドを実行し、GuestShell(CentOS)のデフォルトゲートウェイと参照先DNSサーバーを設定する     
    CSR1(config-app-hosting)# ***app-default-gateway 192.168.X.254 guest-interface 0***   
    CSR1(config-app-hosting)# ***name-server0 10.X.1.104***   
    CSR1(config-app-hosting)# ***exit***  

    ```
    CSR1(config-app-hosting)#app-default-gateway 192.168.255.254 guest-interface 0 
    CSR1(config-app-hosting)#name-server0 10.255.1.104    
    CSR1(config-app-hosting)#exit
    CSR1(config)#
    ```

    > 【補足】
    > GuestShellのデフォルトゲートウェイはRouter1のVirtualPortGroupインターフェイスです。
    > VirtualPortGroupインターフェイスのIPアドレスは、次の手順で設定します。

1. Router1(CSR1)で以下のコマンドを実行し、guestshellの設定が正確であることを確認する  
    CSR1(config)# ***do sh run | sec app-hosting***   

    ```
    CSR1(config)#do sh run | sec app-hosting
    app-hosting appid guestshell
    app-vnic gateway1 virtualportgroup 0 guest-interface 0
    guest-ipaddress 192.168.255.1 netmask 255.255.255.0
    app-default-gateway 192.168.255.254 guest-interface 0
    name-server0 10.255.1.104
    CSR1(config)#
    ```


1. Router1(CSR1)で以下のコマンドを実行し、Router1のVirtualPortGroupインターフェイスのIPアドレスを設定する  
    CSR1(config)# ***default interface VirtualPortGroup0***  
    CSR1(config)# ***interface VirtualPortGroup0***  
    CSR1(config-if)# ***ip address 192.168.X.254 255.255.255.0***  
    CSR1(config-if)# ***end***  
    
    ```
    CSR1(config)#default interface VirtualPortGroup0  
    CSR1(config)#interface VirtualPortGroup0
    CSR1(config-if)#ip address 192.168.255.254 255.255.255.0
    CSR1(config-if)#end
    CSR1#
    ```

    > 【補足】   
    > "default interface VirtualPortGroup0"コマンドは、インターフェイスの設定を初期化するものです。  
    > GuestShellとは無関係な既存のconfigを削除する目的で実行します。  


<!--
【補足】
AzureのCSRが既定で展開するCSRのGuestShellには、GSという名前のVRFが用意されます。   
VRF関連のコマンドオプション操作を演習手順から削除するために、default処理を実行します。  
--> 


1. Router1(CSR1)で以下のコマンドを実行し、Router1のVirtualPortGroupインターフェイスの設定が正しいことを確認する  
    CSR1# ***sh ip int bri***  

    ```
    CSR1#sh ip int bri
    Interface              IP-Address      OK? Method Status                Protocol
    GigabitEthernet1       10.255.2.254    YES DHCP   up                    up      
    GigabitEthernet2       10.255.3.254    YES NVRAM  up                    up      
    VirtualPortGroup0      192.168.255.254   YES manual up                    up      
    CSR1#
    ```



# GuestShellを操作する  
1. Router1(CSR1)で以下のコマンドを実行し、guestshellを有効化する    
    CSR1# ***guestshell enable***   

    ```
    CSR1#guestshell enable
    Interface will be selected if configured in app-hosting
    Please wait for completion
    guestshell installed successfully
    Current state is: DEPLOYED
    guestshell activated successfully
    Current state is: ACTIVATED
    guestshell started successfully
    Current state is: RUNNING
    Guestshell enabled successfully

    CSR1#
    ```


    > 【補足】
    > guestshell enableコマンド実行後、操作を受け付けない待ち時間が発生しますが、想定された動作です。
    > GuestShellの有効化処理が完了後(1~2分程度)、GuestShellのステータスが表示されて、ルータの操作が可能になります。



1. Router1(CSR1)で以下のコマンドを実行し、GuestShellにログインする    
    CSR1# ***guestshell***   

    ```
    CSR1#
    CSR1#guestshell
    [guestshell@guestshell ~]$ 
    ```



1. Router1(CSR1)で以下のコマンドを実行し、GuestShell環境がLinux(CentOS)であることを確認する     
    [guestshell@guestshell ~]$ ***whoami***   
    [guestshell@guestshell ~]$ ***pwd***  
    [guestshell@guestshell ~]$ ***cat /etc/redhat-release***  

    ```
    [guestshell@guestshell ~]$ 
    [guestshell@guestshell ~]$ whoami
    guestshell
    [guestshell@guestshell ~]$ 
    [guestshell@guestshell ~]$ pwd
    /home/guestshell
    [guestshell@guestshell ~]$ 
    [guestshell@guestshell ~]$ cat /etc/redhat-release 
    CentOS Linux release 8.1.1911 (Core) 
    [guestshell@guestshell ~]$ 
    ```

1. Router1(CSR1)で以下のコマンドを実行し、GuestShellの操作を終了する   
    [guestshell@guestshell ~]$ ***exit***   

    ```
    [guestshell@guestshell ~]$ exit
    exit

    CSR1#
    ```

<!--
【補足】    
guestshellをexitしたあと、IOSのターミナル表示が更新されない状態になる場合があります。    
これは演習環境のプラットフォームによる仕様です。    
ターミナルに異変が生じた際は、IOSでexitコマンドを複数回実行してIOSに対するSSH接続を切断してください。
その後の再接続により画面の表示が正常な状態に回復します。  
-->

1. Router1(CSR1)で以下のコマンドを実行し、IOSからGuestShellのLinuxコマンドを実行する   

    CSR1# ***guestshell run yum --version***

    ```
    CSR1#guestshell run yum --version
    4.2.7
    Installed: dnf-0:4.2.7-7.el8_1.noarch at Mon Jun  1 18:23:07 2020
    Built    : CentOS Buildsys <bugs@centos.org> at Thu Dec 19 15:44:23 2019

    Installed: rpm-0:4.14.2-26.el8_1.x86_64 at Mon Jun  1 18:23:06 2020
    Built    : CentOS Buildsys <bugs@centos.org> at Thu Apr  9 18:59:01 2020

    CSR1#
    ```

    > 【補足】  
    > Linuxを操作するコマンドをIOS-XEのコマンドとして実行できます。  

    > 【補足】  
    > GuestShellではyumを使用できます。  
    > 任意のソフトウェアをインストールし、GuestShellをサーバーとして構築することも可能です。  


# GuestShellの外部接続用のNATを構成する 

1. Router1(CSR1)で以下のコマンドを実行し、NAT対象のIPアドレスを識別するACLを構成する   
    CSR1# ***conf t***  
    CSR1(config)# ***ip access-list standard ACL_GuestShellNAT***  
    CSR1(config-std-nacl)# ***permit 192.168.X.0 0.0.0.255***  
    CSR1(config-std-nacl)# ***exit***   

    ```
    CSR1(config)#ip access-list standard ACL_GuestShellNAT
    CSR1(config-std-nacl)#permit 192.168.255.0 0.0.0.255
    CSR1(config-std-nacl)#exit
    CSR1(config)#
    ```

    > 【補足】  
    > 演習環境基盤の仕様により、このルータにはGuestShellのconfigが既定で自動的に作成されています。   
    > そのためshowコマンドでACLのconfigを参照すると別ネットワークを対象とするpermit句が表示される場合がありますが、演習に支障はありません。  


1. Router1(CSR1)で以下のコマンドを実行し、NATを実行するインターフェイスを指定する  
    CSR1(config)# ***interface GigabitEthernet 1***  
    CSR1(config-if)# ***ip nat outside***  
    CSR1(config-if)# ***exit***     
    CSR1(config)# ***interface GigabitEthernet 2***  
    CSR1(config-if)# ***ip nat outside***  
    CSR1(config-if)# ***exit***  
    CSR1(config)# ***interface VirtualPortGroup0***  
    CSR1(config-if)# ***ip nat inside***  
    CSR1(config-if)# ***exit***  

    ```
    CSR1(config)#interface GigabitEthernet 1
    CSR1(config-if)#ip nat outside
    CSR1(config-if)#exit
    CSR1(config)#interface GigabitEthernet 2
    CSR1(config-if)#ip nat outside
    CSR1(config-if)#exit
    CSR1(config)#interface VirtualPortGroup0
    CSR1(config-if)#ip nat inside
    CSR1(config-if)#exit
    CSR1(config)#
    ```

1. Router1(CSR1)で以下のコマンドを実行し、NAT条件を指定する     
    CSR1(config)# ***ip nat inside source list ACL_GuestShellNAT interface GigabitEthernet1 overload***  


    ```
    CSR1(config)#ip nat inside source list ACL_GuestShellNAT interface GigabitEthernet1 overload
    ```

    > 【補足】  
    > コマンド内の"vrf GS"は、VRF(Virtual Routing and Forwarding)という仕組みを使用するための設定です。  
    > VRFはルーティングテーブルを仮想的に分割します。
    > GuestShellのネットワークを社内ネットワークから分離することができます。   



1. Router1(CSR1)で以下のコマンドを実行し、GuestShellがIOS-XE外部と通信できることを確認する      
    CSR1(config)# ***end***   
    CSR1# ***guestshell***   
    [guestshell@guestshell ~]$ ***ping Web1.example.local -c 4***   
    [guestshell@guestshell ~]$ ***ping Linux1.example.local -c 4***  
    [guestshell@guestshell ~]$ ***exit***  

    ```
    CSR1(config)#end  
    CSR1#guestshell
    [guestshell@guestshell ~]$
    [guestshell@guestshell ~]$ ping Web1.example.local -c 4
    PING WSrv2-230802255.example.local (10.255.2.105) 56(84) bytes of data.
    64 bytes from 10.255.2.105 (10.255.2.105): icmp_seq=1 ttl=128 time=1.51 ms
    64 bytes from 10.255.2.105 (10.255.2.105): icmp_seq=2 ttl=128 time=1.74 ms
    64 bytes from 10.255.2.105 (10.255.2.105): icmp_seq=3 ttl=128 time=1.44 ms
    64 bytes from 10.255.2.105 (10.255.2.105): icmp_seq=4 ttl=128 time=1.59 ms

    --- WSrv2-230802255.example.local ping statistics ---
    4 packets transmitted, 4 received, 0% packet loss, time 7ms
    rtt min/avg/max/mdev = 1.437/1.569/1.743/0.117 ms
    [guestshell@guestshell ~]$ ping Linux1.example.local -c 4
    PING Linux1.example.local (10.255.1.102) 56(84) bytes of data.
    64 bytes from 10.255.1.102 (10.255.1.102): icmp_seq=1 ttl=64 time=1.36 ms
    64 bytes from 10.255.1.102 (10.255.1.102): icmp_seq=2 ttl=64 time=1.28 ms
    64 bytes from 10.255.1.102 (10.255.1.102): icmp_seq=3 ttl=64 time=1.29 ms
    64 bytes from 10.255.1.102 (10.255.1.102): icmp_seq=4 ttl=64 time=1.49 ms

    --- Linux1.example.local ping statistics ---
    4 packets transmitted, 4 received, 0% packet loss, time 7ms
    rtt min/avg/max/mdev = 1.278/1.353/1.492/0.089 ms
    [guestshell@guestshell ~]$ 
    [guestshell@guestshell ~]$ exit
    
    CSR1#
    ```

    > 【確認ポイント】
    > GuestShellから10.X.1.0/24や10.X.2.0/24と通信できることを確認する

    > 【補足】
    > "ping -c 4"オプションは、パケットの送信を4回に指定します。
    > -cオプションをつけずにpingを実行すると、管理者が明示的に停止を操作するまで繰り返しpingを実行します。
    > なお、停止操作は、Ctrl + C です。



# IOSのconfigを保存する  

1. Router1(CSR1)で以下のコマンドを実行し、IOSのconfigを保存する  
    CSR1# ***write*** 

    ```
    CSR1#write
    Building configuration...
    [OK]
    CSR1#
    ```




# 演習完了  
ここまでの手順で、以下の項目を学習できました。
- [x] GuestShellを構成する  
- [x] GuestShellにログインする  
- [x] GuestShellをIOSから操作する  
- [x] GuestShellと外部環境を通信させる  

